tap "oven-sh/bun"
tap "timescam/tap"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Command-line fuzzy finder written in Go
brew "fzf"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Deep clean and optimize your Mac
brew "mole"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@16", restart_service: :changed, link: true
# Develop and deploy code with zero configuration
brew "railway"
# Zsh prompt for Astronauts
brew "spaceship"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Command-line interface for 1Password
cask "1password-cli"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
# Control your tools with a few keystrokes
cask "raycast"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "humao.rest-client"
vscode "jakob101.relativepath"
vscode "miguelsolorio.fluent-icons"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.live-server"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "usernamehw.errorlens"
vscode "wallabyjs.console-ninja"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
npm "corepack"
npm "pnpm"
